[{"id":1,"title":"Pixel Art Maker","content":"Pixel art maker is a web art editor that allows you to draw pixel art. The project was built with vanillaJS.","date":"jan 2018","link":"http://giovannilara.com/pixel-art-maker/","keywords":"","status":"live"},{"id":2,"title":"Jean Doette Portfolio Website","content":"For this project a mock-up was given to replicate the design only using HTML and CSS (frameworks weren't allowed). The site is responsive and displays images, descriptions and links to each of the portfolio project.","date":"mar 2018","link":"http://giovannilara.com/FEND-project-01-portfolio/","keywords":"","status":"live"},{"id":3,"title":"Memory Match Game","content":"The task for this project was to make a matching cards game with vanillaJS.","date":"apr 2018","link":"http://giovannilara.com/FEND-memory-game-project/","keywords":"","status":"live"},{"id":4,"title":"Frogger Arcade Game","content":"This is a web game written in vanillaJS and HTML5 Canvas API, its a clone game from the classic arcade game Frogger. I implemented the game functionality and designed the UI.","date":"may 2018","link":"http://giovannilara.com/FEND-arcade-game/","keywords":"","status":"live"},{"id":5,"title":"Restaurant Reviews Website","content":"The task in hand was to convert a static webpage for restaurants to a mobile-ready web application. I added a11y and convert the design to be responsive. Last, I add a service worker to begin the process of creating a seamless offline experience for users.","date":"jun 2018","link":"http://giovannilara.com/FEND-restaurant-reviews-app-1/","keywords":"","status":"live"},{"id":6,"title":"My Reads web/app","content":"This project is a books website and my first React app. A user can search books from a books API (Udacity books API), the user can add/move books to the e.g., read, want to read, and currently reading shelves.","date":"jul 2018","link":"https://github.com/gioalo/FEND-my-reads-app","keywords":"","status":"repo"},{"id":7,"title":"My Neighborhood Maps","content":"For this project the task was to make a maps app, super cool! My app displays the parks maps in the Bay Area. The user can filter/search the parks by location and category. The app uses third-party APIs services (Foursquare Places API and the Leaflet Maps).","date":"aug 2018","link":"https://github.com/gioalo/FEND-neighborhood-maps-app","keywords":"","status":"repo"},{"id":8,"title":"Sass Master","content":"This project its been cooking with Sass. Its just a collection of modules for typography settings (vertical rhythm, font size ratios), grids, media-queries, colours, that kind of stuff!","date":"ongoing","link":"","keywords":"","status":"coming soon"}]